package ru.kraskitour.bot.util;

public class Texts {

    public static final String START_CAPTION =
            "<b>Спасибо, что обратились в турагентство  «Краски Тур»!</b>\n" +
                    "Мы подбираем путешествия с вниманием к деталям и заботой о каждом туристе ❤️\n" +
                    "Профессиональный подход, честные рекомендации и поддержка 24/7 — то, за что нас выбирают!\n\n" +
                    "<b>Выберите то, что Вас интересует:</b>";

    // Подобрать тур (картинки 2-5)
    public static final String TOUR_Q1 =
            "🌍✈️ <b>Какие страны Вы рассматриваете для отдыха и из каких городов?</b>\n" +
                    "<i>(Можно написать несколько через запятую)</i>";

    public static final String TOUR_Q2 =
            "👨‍👩‍👧‍👦 <b>В каком составе планируется поездка?</b>\n" +
                    "<i>(Если есть дети, то укажите возраст на момент поездки)</i>";

    public static final String TOUR_Q3 =
            "📅🏨 <b>В какие даты должна состояться поездка и какое желаемое количество ночей?</b>";

    public static final String TOUR_Q4 =
            "💰⭐ <b>Если есть дополнительные пожелания по бюджету/ категории отеля, то пропишите их</b>🙂\n" +
                    "<i>Так нам будет проще подобрать самые подходящие варианты</i>";

    public static final String ASK_PHONE =
            "✅ <b>Спасибо, Ваша заявка в работе!</b>\n" +
                    "Укажите, пожалуйста, свой <b>номер телефона</b>, скоро свяжемся с Вами 📞";

    // ✅ Новое сообщение после получения номера телефона
    public static final String PHONE_SAVED =
            "✅ <b>Записали Ваш номер телефона.</b>\n" +
                    "⏳ Наш менеджер скоро свяжется с Вами";

    // Schengen
    public static final String SCHENGEN_MAIN =
            "<b>Мы помогаем с оформлением виз в страны Шенгена уже 14 лет.</b>\n" +
                    "Проконсультируем по всем нюансам и поможем спланировать отпуск в Европу ✈️";

    public static final String SCHENGEN_PRICES =
            "<b>Что входит в наши услуги?:</b>\n" +
                    "- Консультация  по подготовке необходимых документов\n" +
                    "- Заполнение анкеты\n" +
                    "- Бронирование отеля\n" +
                    "- Бронирование авиабилетов\n" +
                    "- Оформление мед. страховки\n\n" +
                    "<b>Цены:</b>\n\n" +
                    " <b>10 000 р./чел</b> – если подается один человек\n" +
                    " <b>9 000 р./чел</b> – если подаются 2 чел. и более\n" +
                    " <b>6 000 р.</b>  - для ребенка до 12 лет  (подающего документы совместно с родителями)\n" +
                    " <b>1500р./чел</b> – за услуги записи в ВЦ";

    // Hotel no tour
    public static final String HOTEL_MAIN =
            "Мы бронируем отели по всему миру <b>без перелёта</b> и часто предлагаем цены <b>выгоднее популярных агрегаторов.</b>\n" +
                    "Мы работаем с несколькими надёжными <b>международными партнёрами</b> и полностью несем ответственность за каждое бронирование ✅\n" +
                    "<b>Главное преимущество</b> — любой отель можно <b>оплатить в рублях</b>, по официальному счёту или с <b>юридического лица</b>. " +
                    "Просто, прозрачно и без лишних сложностей!";

    public static final String HOTEL_COMPARE_ASK_PHOTO =
            "📸 Отправьте скриншот предложения, которое Вы нашли на просторах интернета, и мы постараемся предложить лучшую цену.";

    public static final String HOTEL_PICK_Q1 =
            "🌍🏙️ Напишите интересующую страну и город";

    public static final String HOTEL_PICK_Q2 =
            "📅👥 Напишите точные даты проживания и количество человек (если есть дети, то нужно указать их возраст)";

    // Socials
    public static final String SOCIALS_MAIN =
            "Выберите соцсеть 👇";

    public static final String TG_CHANNEL =
            "<b>Обязательно подписывайся на наш канал с выгодными предложениям</b> ✈️☀️🌴\n\n" +
                    "<b>У нас:</b>\n" +
                    "✅ удобная навигация по каналу (в закрепах)\n" +
                    "✅ акции и спец предложения\n" +
                    "✅ честные обзоры отелей с реальными видео\n" +
                    "✅ подкасты на самые интересные темы\n" +
                    "✅ личные переживания , конфузы в работе и живое общение\n\n" +
                    "<b>Мы в курсе всех новинок отелей!</b>\n" +
                    "https://t.me/kraskitour";

    public static final String INSTAGRAM =
            "<b>Если еще не подписан , то подписывайся!</b>\n\n" +
                    "<b>В нашем insta:</b>\n\n" +
                    "✅ личные stories из путешествий\n" +
                    "✅ обзоры отелей\n" +
                    "✅ reels с актуальными темами про путешествия\n\n" +
                    "<b>Мы всегда в теме трендов и актуальных новостей</b> 😎\n" +
                    "https://www.instagram.com/kraskitour?igsh=dWxxODEza2s3MmNu";

    // Office
    public static final String OFFICE =
            "📍 Будем рады видеть Вас в нашем офисе по адресу:\n" +
                    "г.Нижний Новгород , ул.Большая Печёрская , д.39 , офис 3 (цокольный этаж)\n\n" +
                    "🚪 Вход с «Красной линии», нужно спуститься по лестнице вниз , указатель находится под вывеской «ЦЕНТРИНВЕСТБАНК»\n\n" +
                    "📞 Телефоны для связи:\n" +
                    "<a href=\"tel:+79934343030\">+79934343030</a>\n" +
                    "<a href=\"tel:+79200603030\">+79200603030</a>\n\n" +
                    "🕒 Режим работы офиса с 11:00 до 19:00 будни. Выходные по договоренности.";
}